# -*- org-return-follows-link: t; -*-
#+TITLE: space.cloudnative.nz
#+AUTHOR: Hippie Hacker
#+EMAIL: hh@ii.coop
#+DATE: 17th of July, 2023
#+PROPERTY: header-args:bash+ :results replace verbatim code output
#+PROPERTY: header-args:bash+ :var SPACEDOMAIN=(symbol-value 'space-domain)
#+NOPROPERTY: header-args:bash+ :var TSOCKET=(symbol-value 'tmux-socket)
#+PROPERTY: header-args:bash+ :dir (symbol-value 'tramp-dir)
#+PROPERTY: header-args:bash+ :wrap example
#+PROPERTY: header-args:bash+ :async
#+PROPERTY: header-args:shell+ :results replace verbatim code output
#+PROPERTY: header-args:shell+ :var SPACEDOMAIN=(symbol-value 'space-domain)
#+PROPERTY: header-args:shell+ :var KUBECONFIG=(concat (getenv "HOME") "/.kube/config-" space-domain)
#+NOPROPERTY: header-args:shell+ :var TSOCKET=(symbol-value 'tmux-socket)
#+PROPERTY: header-args:shell+ :async
#+NOPROPERTY: header-args:tmux+ :session "io:ssh"
#+NOPROPERTY: header-args:tmux+ :socket (symbol-value 'tmux-socket)
#+STARTUP: content
#+STARTUP: showeverything
#+STARTUP: overview
#+STARTUP: show2levels
*** What is my ip?
#+begin_src bash :sync
curl ifconfig.me
#+end_src

#+RESULTS:
#+begin_example
123.253.178.101
#+end_example

We know this works because we own the IPs, if you do this elsewhere, you may want to configure your home router to forward these ports via DMZ or similar to your Ubuntu box. It may have a local ip in the RFC1918 IP ranges (192.168.1.X being the most common)
** Domain
NS Records and a separate tsig key are configured on powerdns.ii.nz
#+name: spacedomain
#+begin_src bash :wrap "example" :sync :cache yes
echo -n $SPACEDOMAIN
#+end_src

#+RESULTS[c74d797bc2492484b0850b90b9116d5de2265105]: spacedomain
#+begin_example
cloudnative.nz
#+end_example

** What is our IP?
#+begin_src bash :sync
curl -L https://ifconfig.me
#+end_src

#+RESULTS:
#+begin_example
123.253.178.101
#+end_example

** Add DOMAIN -> Address pointing our IP
We did this via the GUI, but here is the verified result.
#+name: add main A record
#+begin_src shell
dig A $SPACEDOMAIN +short
#+end_src

#+RESULTS: add main A record
#+begin_example
123.253.178.101
#+end_example

** Add *.DOMAIN -> Address pointing to our IP
#+name: add wildcard A record
#+begin_src shell
dig A random123.$SPACEDOMAIN +short
#+end_src

#+RESULTS: add wildcard A record
#+begin_example
123.253.178.101
#+end_example
** Pull down kubernetes container images
#+begin_src bash :sync
kubeadm config images pull
#+end_src

#+RESULTS:
#+begin_example
[config/images] Pulled registry.k8s.io/kube-apiserver:v1.27.3
[config/images] Pulled registry.k8s.io/kube-controller-manager:v1.27.3
[config/images] Pulled registry.k8s.io/kube-scheduler:v1.27.3
[config/images] Pulled registry.k8s.io/kube-proxy:v1.27.3
[config/images] Pulled registry.k8s.io/pause:3.9
[config/images] Pulled registry.k8s.io/etcd:3.5.7-0
[config/images] Pulled registry.k8s.io/coredns/coredns:v1.10.1
#+end_example

** Gateway API
- https://isovalent.com/blog/post/tutorial-getting-started-with-the-cilium-gateway-api/
Looks like there's a new version at:
- https://gateway-api.sigs.k8s.io/guides/#install-standard-channel

#+begin_src tmux
kubectl apply -f \
    https://github.com/kubernetes-sigs/gateway-api/releases/download/v0.7.1/standard-install.yaml
#+end_src

#+RESULTS:
#+begin_example
customresourcedefinition.apiextensions.k8s.io/gatewayclasses.gateway.networking.k8s.io created
customresourcedefinition.apiextensions.k8s.io/gateways.gateway.networking.k8s.io created
customresourcedefinition.apiextensions.k8s.io/httproutes.gateway.networking.k8s.io created
customresourcedefinition.apiextensions.k8s.io/referencegrants.gateway.networking.k8s.io created
namespace/gateway-system created
validatingwebhookconfiguration.admissionregistration.k8s.io/gateway-api-admission created
service/gateway-api-admission-server created
deployment.apps/gateway-api-admission-server created
serviceaccount/gateway-api-admission created
clusterrole.rbac.authorization.k8s.io/gateway-api-admission created
clusterrolebinding.rbac.authorization.k8s.io/gateway-api-admission created
role.rbac.authorization.k8s.io/gateway-api-admission created
rolebinding.rbac.authorization.k8s.io/gateway-api-admission created
job.batch/gateway-api-admission created
job.batch/gateway-api-admission-patch created
#+end_example

*** list gpg keys
#+begin_src shell :env KEY_NAME="k8s.cloudnative.nz" :sync
export KEY_NAME="k8s.cloudnative.nz"
gpg --list-secret-keys "${KEY_NAME}"
#+end_src

#+RESULTS:
#+begin_example
sec   rsa4096 2023-06-30 [SCEAR]
      7753811D61BD7B2F83C55F3299211032AFAC5FD8
uid           [ultimate] k8s.cloudnative.nz (flux secrets)
ssb   rsa4096 2023-06-30 [SEAR]

#+end_example

*** import into kubernetes
#+begin_src shell :env KEY_NAME="k8s.cloudnative.nz" :sync
export KEY_NAME="k8s.cloudnative.nz"
export KEY_FP=$(gpg --list-secret-keys "${KEY_NAME}" | grep SCEA -A1 | tail -1 | awk '{print $1}')
kubectl delete secret sops-gpg --namespace=flux-system || true
gpg --export-secret-keys --armor "${KEY_FP}" |
kubectl create secret generic sops-gpg \
--namespace=flux-system \
--from-file=sops.asc=/dev/stdin
#+end_src

#+RESULTS:
#+begin_example
secret "sops-gpg" deleted
secret/sops-gpg created
#+end_example

*** get the ingress
#+begin_src bash :epilogue "\n) 2>&1\n:\n" :prologue "(\nexport KUBECONFIG\n" :dir . :sync
kubectl -n flux-system get ingress webhook-receiver
#+end_src

#+RESULTS:
#+begin_example
NAME               CLASS   HOSTS                         ADDRESS           PORTS     AGE
webhook-receiver   nginx   flux-webhook.cloudnative.nz   123.253.178.101   80, 443   4m26s
#+end_example

*** get the hook path
We need to encrypt the secret with sops and commit/push so flux can decrypt and apply it
#+begin_src bash :epilogue "\n) 2>&1\n:\n" :prologue "(\nexport KUBECONFIG\n" :dir . :sync
kubectl -n flux-system get receiver
#+end_src

#+RESULTS:
#+begin_example
NAME              AGE     READY   STATUS
github-receiver   3m47s   True    Receiver initialized for path: /hook/e698be0afc8e5e2cc3c9d8780fc955309a55e3b692ed5110e9e1d8f639d0b1ab
#+end_example
*** combine them into something like
Use the Secret and this PayloadURL to create a new webook:
[[https://github.com/cloudnative-nz/infra/settings/hooks/new]]
#+begin_src bash :epilogue "\n) 2>&1\n:\n" :prologue "(\nexport KUBECONFIG\n" :dir . :sync
echo PayloadURL: https://$(kubectl -n flux-system get ingress webhook-receiver -o jsonpath="{.spec.rules[0].host}")$(kubectl -n flux-system get receiver github-receiver -o jsonpath="{.status.webhookPath}")
#+end_src

#+RESULTS:
#+begin_example
PayloadURL: https://flux-webhook.cloudnative.nz/hook/e698be0afc8e5e2cc3c9d8780fc955309a55e3b692ed5110e9e1d8f639d0b1ab
#+end_example
*** import into kubernetes
#+begin_src shell :env KEY_NAME="k8s.cloudnative.nz"
export KEY_NAME="k8s.cloudnative.nz"
export KEY_FP=$(gpg --list-secret-keys "${KEY_NAME}" | grep SCEAR -A1 | tail -1 | awk '{print $1}')
gpg --export-secret-keys --armor "${KEY_FP}" |
kubectl create secret generic sops-gpg \
--namespace=flux-system \
--from-file=sops.asc=/dev/stdin
#+end_src

#+RESULTS:
#+begin_example
secret/sops-gpg created
#+end_example
